In [2]:
import pandas as pd

In [19]:
ds=pd.read_csv('../data/2016/DistinguishedService.txt')
ds.head()

   Unnamed: 0  Place             Name  Ag Sex  St      Time  Pace
0          23      1       Eric Young  24   M  NY  00:48:35  6:05
1          24      2       Ben Heller  26   M  NY  00:50:54  6:22
2          25      3        Bob Irwin  43   M  NY  00:52:18  6:33
3          26      4      Chuck Terry  34   M  NY  00:52:19  6:33
4          27      5  Mark Stephenson  52   M  NY  00:52:21  6:33

In [20]:
test = pd.DataFrame(ds.Name.str.split(' ',1).tolist(),
                                   columns = ['FIRST_NAME','LAST_NAME'])

ds=ds.drop('Name',1)
ds=ds.join(test)
ds=ds.drop('Unnamed: 0',1)
ds.head()

   Place  Ag Sex  St      Time  Pace FIRST_NAME   LAST_NAME
0      1  24   M  NY  00:48:35  6:05       Eric       Young
1      2  26   M  NY  00:50:54  6:22        Ben      Heller
2      3  43   M  NY  00:52:18  6:33        Bob       Irwin
3      4  34   M  NY  00:52:19  6:33      Chuck       Terry
4      5  52   M  NY  00:52:21  6:33       Mark  Stephenson

In [5]:
def time_to_hhmmss_str(time):
    ts=time.split(':')
    if int(ts[0])>10:
        strtime='00:'+ts[0]+':'+ts[1]
    else:
        strtime=ts[0]+':'+ts[1]+':'+ts[2]
    return strtime

In [6]:
import sys
sys.path.append('../util/race/')

import utils
reload(utils)
from utils import time_to_hh_mm_ss_str

In [7]:
ds['Time']=ds.Time.apply(lambda x: time_to_hh_mm_ss_str(x))

In [8]:
ds.head()

   Place               Name  Ag Sex  St     Time  Pace
0      1  Elizabeth Chauhan  31   F  NY  1:01:14  7:40
1      2      Alex Thompson  16   F  NY  1:04:17  8:03
2      3   Hannah Gallagher  15   F  NY  1:04:24  8:03
3      4   Meghan Mortensen  30   F  NY  1:09:41  8:43
4      5    Martha Degrazia  65   F  NY  1:10:35  8:50

In [9]:
ds=ds.sort(['Time'],ascending=True)

/home/bnorthan/anaconda/lib/python2.7/site-packages/IPython/kernel/__main__.py:1: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  if __name__ == '__main__':

In [10]:
ds.head()

    Place             Name  Ag Sex  St      Time  Pace
23      1       Eric Young  24   M  NY  00:48:35  6:05
24      2       Ben Heller  26   M  NY  00:50:54  6:22
25      3        Bob Irwin  43   M  NY  00:52:18  6:33
26      4      Chuck Terry  34   M  NY  00:52:19  6:33
27      5  Mark Stephenson  52   M  NY  00:52:21  6:33

In [26]:

ds.to_csv('../data/2016/DistinguishedService2.csv',index=False)